app/views/posts/index.html.erb

              <li><%= post.created_at.strftime("%B %d, %Y %H:%M")%></li>
              <li><%= link_to user_path(User.find(post.user_id)) do  %>
                <%= User.find(post.user_id).first_name %>
                <%= User.find(post.user_id).last_name %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]