app/views/posts/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        <p class="card-text"><%= @post.content %></p>
        <%= link_to user_path(User.find(@post.user_id)) do  %>
          <%= User.find(@post.user_id).first_name %>
          <%= User.find(@post.user_id).last_name %>