app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY created_at DESC
---
        def index
            @posts = Post.all.order('created_at DESC');

INSERT INTO "posts" ("user_id", "title", "lead", "content", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
        def create
            @post = @user.posts.create(get_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        def load_post
            @post = Post.find(params[:id])